Table of Contents
 Class NadSetupValue
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Setup value base
public abstract class NadSetupValue
Inheritance
object
NadSetupValue
Derived
NadSetupValueBool
NadSetupValueDouble
NadSetupValueFloat
NadSetupValueInt
NadSetupValueLong
NadSetupValueShort
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Id
Gets or sets the value id.
public int Id { get; set; }
Property Value
int
 IsActive
Is active
public bool IsActive { get; set; }
Property Value
bool
 Edit this page